         01 CS-BUSY     pic s9(9) comp-5
            value is -4.
         01 CS-INTERRUPT        pic s9(9) comp-5
            value is -5.
         01 CS-MAX-LOCALE       pic s9(9) comp-5
            value is 68.
         01 CS-MAX-NAME pic s9(9) comp-5
            value is 255.
         01 CS-MAX-NUMLEN       pic s9(9) comp-5
            value is 33.
         01 CS-NO-COUNT pic s9(9) comp-5
            value is -1.
         01 CS-OBJ-NAME pic s9(9) comp-5
            value is 769.
         01 CS-PENDING  pic s9(9) comp-5
            value is -2.
         01 CS-QUIET    pic s9(9) comp-5
            value is -3.
         01 CS-TRYING   pic s9(9) comp-5
            value is -213.
         01 CS-12HOUR   pic s9(9) comp-5
            value is 7344.
         01 CS-ABSOLUTE pic s9(9) comp-5
            value is 3004.
         01 CS-ACK      pic s9(9) comp-5
            value is 724.
         01 CS-ADD      pic s9(9) comp-5
            value is 1.
         01 CS-ALLMSG-TYPE      pic s9(9) comp-5
            value is 4702.
         01 CS-ALLOC    pic s9(9) comp-5
            value is 710.
         01 CS-ALL-CAPS pic s9(9) comp-5
            value is 2700.
         01 CS-ANSI-BINDS       pic s9(9) comp-5
            value is 9123.
         01 CS-APPNAME  pic s9(9) comp-5
            value is 9102.
         01 CS-ASYNC-IO pic s9(9) comp-5
            value is 8112.
         01 CS-BIGINT-TYPE      pic s9(9) comp-5
            value is 30.
         01 CS-BINARY-TYPE      pic s9(9) comp-5
            value is 1.
         01 CS-BIT-TYPE pic s9(9) comp-5
            value is 11.
         01 CS-BLANK-TERM       pic s9(9) comp-5
            value is -100.
         01 CS-BLK-HAS-TEXT     pic s9(9) comp-5
            value is -6.
         01 CS-BROWSE-INFO      pic s9(9) comp-5
            value is 807.
         01 CS-BULK-CONT        pic s9(9) comp-5
            value is 191.
         01 CS-BULK-DATA        pic s9(9) comp-5
            value is 192.
         01 CS-BULK-INIT        pic s9(9) comp-5
            value is 190.
         01 CS-BULK-LOGIN       pic s9(9) comp-5
            value is 9124.
         01 CS-BYLIST-LEN       pic s9(9) comp-5
            value is 5354.
         01 CS-CANBENULL        pic s9(9) comp-5
            value is 32.
         01 CS-CANCELED pic s9(9) comp-5
            value is -202.
         01 CS-CANCEL-ALL       pic s9(9) comp-5
            value is 6001.
         01 CS-CANCEL-ATTN      pic s9(9) comp-5
            value is 6002.
         01 CS-CANCEL-CURRENT   pic s9(9) comp-5
            value is 6000.
         01 CS-CAP-ARRAYLEN     pic s9(9) comp-5
            value is 16.
         01 CS-CAP-REQUEST      pic s9(9) comp-5
            value is 1.
         01 CS-CAP-RESPONSE     pic s9(9) comp-5
            value is 2.
         01 CS-CHALLENGE-CB     pic s9(9) comp-5
            value is 6.
         01 CS-CHARSETCNV       pic s9(9) comp-5
            value is 9106.
         01 CS-CHAR-TYPE        pic s9(9) comp-5
            value is 0.
         01 CS-CLEAR    pic s9(9) comp-5
            value is 35.
         01 CS-CLEAR-FLAG       pic s9(9) comp-5
            value is 1701.
         01 CS-CLIENTMSG-CB     pic s9(9) comp-5
            value is 3.
         01 CS-CLIENTMSG-TYPE   pic s9(9) comp-5
            value is 4700.
         01 CS-CMD-DONE pic s9(9) comp-5
            value is 4046.
         01 CS-CMD-FAIL pic s9(9) comp-5
            value is 4048.
         01 CS-CMD-NUMBER       pic s9(9) comp-5
            value is 801.
         01 CS-CMD-SUPPRESS-FMT pic s9(9) comp-5
            value is 9226.
         01 CS-CMD-SUCCEED      pic s9(9) comp-5
            value is 4047.
         01 CS-COBBIGINT-TYPE   pic s9(9) comp-5
            value is 123.
         01 CS-COBINT-TYPE      pic s9(9) comp-5
            value is 104.
         01 CS-COBMEDINT-TYPE   pic s9(9) comp-5
            value is 103.
         01 CS-COBSINT-TYPE     pic s9(9) comp-5
            value is 118.
         01 CS-COBSMALLINT-TYPE pic s9(9) comp-5
            value is 102.
         01 CS-COBSSWAPINT-TYPE pic s9(9) comp-5
            value is 119.
         01 CS-COBTINYINT-TYPE  pic s9(9) comp-5
            value is 101.
         01 CS-COBUINT-TYPE     pic s9(9) comp-5
            value is 116.
         01 CS-COBUSWAPINT-TYPE pic s9(9) comp-5
            value is 117.
         01 CS-COLUMN-DATA      pic s9(9) comp-5
            value is 193.
         01 CS-COMMBLOCK        pic s9(9) comp-5
            value is 9109.
         01 CS-COMPARE  pic s9(9) comp-5
            value is 7440.
         01 CS-COMPLETION-CB    pic s9(9) comp-5
            value is 1.
         01 CS-COMPNUM-TYPE     pic s9(9) comp-5
            value is 113.
         01 CS-COMPUTEFMT-RESULT        pic s9(9) comp-5
            value is 4050.
         01 CS-COMPUTE-RESULT   pic s9(9) comp-5
            value is 4045.
         01 CS-COMP-BYLIST      pic s9(9) comp-5
            value is 5353.
         01 CS-COMP-COLID       pic s9(9) comp-5
            value is 5352.
         01 CS-COMP-ID  pic s9(9) comp-5
            value is 5351.
         01 CS-COMP-OP  pic s9(9) comp-5
            value is 5350.
         01 CS-CONFIG-BY-SERVERNAME     pic s9(9) comp-5
            value is 9157.
         01 CS-CONV-ERR pic s9(9) comp-5
            value is -100.
         01 CS-CON-INBAND       pic s9(9) comp-5
            value is 40.
         01 CS-CON-LOGICAL      pic s9(9) comp-5
            value is 41.
         01 CS-CON-NOINBAND     pic s9(9) comp-5
            value is 28.
         01 CS-CON-NOOOB        pic s9(9) comp-5
            value is 27.
         01 CS-CON-OOB  pic s9(9) comp-5
            value is 39.
         01 CS-CSR-ABS  pic s9(9) comp-5
            value is 36.
         01 CS-CSR-FIRST        pic s9(9) comp-5
            value is 34.
         01 CS-CSR-LAST pic s9(9) comp-5
            value is 35.
         01 CS-CSR-MULTI        pic s9(9) comp-5
            value is 38.
         01 CS-CSR-PREV pic s9(9) comp-5
            value is 33.
         01 CS-CSR-REL  pic s9(9) comp-5
            value is 37.
         01 CS-CURSOR-CLOSE     pic s9(9) comp-5
            value is 706.
         01 CS-CURSOR-DEALLOC   pic s9(9) comp-5
            value is 707.
         01 CS-CURSOR-DECLARE   pic s9(9) comp-5
            value is 700.
         01 CS-CURSOR-DELETE    pic s9(9) comp-5
            value is 705.
         01 CS-CURSOR-FETCH     pic s9(9) comp-5
            value is 708.
         01 CS-CURSOR-INFO      pic s9(9) comp-5
            value is 709.
         01 CS-CURSOR-OPEN      pic s9(9) comp-5
            value is 701.
         01 CS-CURSOR-RESULT    pic s9(9) comp-5
            value is 4041.
         01 CS-CURSOR-ROWS      pic s9(9) comp-5
            value is 703.
         01 CS-CURSOR-UPDATE    pic s9(9) comp-5
            value is 704.
         01 CS-CURSTAT-CLOSED   pic s9(9) comp-5
            value is 4.
         01 CS-CURSTAT-DEALLOC  pic s9(9) comp-5
            value is 64.
         01 CS-CURSTAT-DECLARED pic s9(9) comp-5
            value is 1.
         01 CS-CURSTAT-INSENSITIVE      pic s9(9) comp-5
            value is 1024.
         01 CS-CURSTAT-NONE     pic s9(9) comp-5
            value is 0.
         01 CS-CURSTAT-OPEN     pic s9(9) comp-5
            value is 2.
         01 CS-CURSTAT-RDONLY   pic s9(9) comp-5
            value is 8.
         01 CS-CURSTAT-ROWCOUNT pic s9(9) comp-5
            value is 32.
         01 CS-CURSTAT-SCROLLABLE       pic s9(9) comp-5
            value is 128.
         01 CS-CURSTAT-SEMISENSITIVE    pic s9(9) comp-5
            value is 2048.
         01 CS-CURSTAT-UPDATABLE        pic s9(9) comp-5
            value is 16.
         01 CS-CURSTAT-RELLOCKS-ONCLOSE pic s9(9) comp-5
            value is 8192.
         01 CS-CUR-ID   pic s9(9) comp-5
            value is 9127.
         01 CS-CUR-NAME pic s9(9) comp-5
            value is 9128.
         01 CS-CUR-ROWCOUNT     pic s9(9) comp-5
            value is 9129.
         01 CS-CUR-STATUS       pic s9(9) comp-5
            value is 9126.
         01 CS-DATA-BIN pic s9(9) comp-5
            value is 16.
         01 CS-DATA-BIT pic s9(9) comp-5
            value is 13.
         01 CS-DATA-CHAR        pic s9(9) comp-5
            value is 14.
         01 CS-DATA-DATE        pic s9(9) comp-5
            value is 72.
         01 CS-DATA-DATE4       pic s9(9) comp-5
            value is 21.
         01 CS-DATA-DATE8       pic s9(9) comp-5
            value is 20.
         01 CS-DATA-DATETIMEN   pic s9(9) comp-5
            value is 31.
         01 CS-DATA-DEC pic s9(9) comp-5
            value is 27.
         01 CS-DATA-FLT4        pic s9(9) comp-5
            value is 22.
         01 CS-DATA-FLT8        pic s9(9) comp-5
            value is 23.
         01 CS-DATA-IMAGE       pic s9(9) comp-5
            value is 26.
         01 CS-DATA-INT1        pic s9(9) comp-5
            value is 10.
         01 CS-DATA-INT2        pic s9(9) comp-5
            value is 11.
         01 CS-DATA-INT4        pic s9(9) comp-5
            value is 12.
         01 CS-DATA-INT8        pic s9(9) comp-5
            value is 52.
         01 CS-DATA-INTN        pic s9(9) comp-5
            value is 30.
         01 CS-DATA-LBIN        pic s9(9) comp-5
            value is 29.
         01 CS-DATA-LCHAR       pic s9(9) comp-5
            value is 28.
         01 CS-DATA-MNY4        pic s9(9) comp-5
            value is 19.
         01 CS-DATA-MNY8        pic s9(9) comp-5
            value is 18.
         01 CS-DATA-MONEYN      pic s9(9) comp-5
            value is 32.
         01 CS-DATA-NOBIN       pic s9(9) comp-5
            value is 10.
         01 CS-DATA-NOBIT       pic s9(9) comp-5
            value is 7.
         01 CS-DATA-NOCHAR      pic s9(9) comp-5
            value is 8.
         01 CS-DATA-NODATE      pic s9(9) comp-5
            value is 51.
         01 CS-DATA-NODATE4     pic s9(9) comp-5
            value is 15.
         01 CS-DATA-NODATE8     pic s9(9) comp-5
            value is 14.
         01 CS-DATA-NODATETIMEN pic s9(9) comp-5
            value is 25.
         01 CS-DATA-NODEC       pic s9(9) comp-5
            value is 21.
         01 CS-DATA-NOFLT4      pic s9(9) comp-5
            value is 16.
         01 CS-DATA-NOFLT8      pic s9(9) comp-5
            value is 17.
         01 CS-DATA-NOIMAGE     pic s9(9) comp-5
            value is 20.
         01 CS-DATA-NOINT1      pic s9(9) comp-5
            value is 4.
         01 CS-DATA-NOINT2      pic s9(9) comp-5
            value is 5.
         01 CS-DATA-NOINT4      pic s9(9) comp-5
            value is 6.
         01 CS-DATA-NOINT8      pic s9(9) comp-5
            value is 35.
         01 CS-DATA-NOINTN      pic s9(9) comp-5
            value is 24.
         01 CS-DATA-NOLBIN      pic s9(9) comp-5
            value is 23.
         01 CS-DATA-NOLCHAR     pic s9(9) comp-5
            value is 22.
         01 CS-DATA-NOMNY4      pic s9(9) comp-5
            value is 13.
         01 CS-DATA-NOMNY8      pic s9(9) comp-5
            value is 12.
         01 CS-DATA-NOMONEYN    pic s9(9) comp-5
            value is 26.
         01 CS-DATA-NONUM       pic s9(9) comp-5
            value is 18.
         01 CS-DATA-NOTEXT      pic s9(9) comp-5
            value is 19.
         01 CS-DATA-NOTIME      pic s9(9) comp-5
            value is 52.
         01 CS-DATA-NOUINT2     pic s9(9) comp-5
            value is 41.
         01 CS-DATA-NOUINT4     pic s9(9) comp-5
            value is 42.
         01 CS-DATA-NOUINT8     pic s9(9) comp-5
            value is 43.
         01 CS-DATA-NOVBIN      pic s9(9) comp-5
            value is 11.
         01 CS-DATA-NOVCHAR     pic s9(9) comp-5
            value is 9.
         01 CS-DATA-NOXML       pic s9(9) comp-5
            value is 59.
         01 CS-DATA-NUM pic s9(9) comp-5
            value is 24.
         01 CS-DATA-TEXT        pic s9(9) comp-5
            value is 25.
         01 CS-DATA-TIME        pic s9(9) comp-5
            value is 73.
         01 CS-DATA-UINT2       pic s9(9) comp-5
            value is 62.
         01 CS-DATA-UINT4       pic s9(9) comp-5
            value is 63.
         01 CS-DATA-UINT8       pic s9(9) comp-5
            value is 64.
         01 CS-DATA-VBIN        pic s9(9) comp-5
            value is 17.
         01 CS-DATA-VCHAR       pic s9(9) comp-5
            value is 15.
         01 CS-DATE-TYPE        pic s9(9) comp-5
            value is 27.
         01 CS-DATA-XML pic s9(9) comp-5
            value is 86.
         01 CS-DATEORDER        pic s9(9) comp-5
            value is 7343.
         01 CS-DATETIME4-TYPE   pic s9(9) comp-5
            value is 13.
         01 CS-DATETIME-TYPE    pic s9(9) comp-5
            value is 12.
         01 CS-DAYNAME  pic s9(9) comp-5
            value is 7342.
         01 CS-DBG-ALL  pic s9(9) comp-5
            value is 1.
         01 CS-DBG-API-STATES   pic s9(9) comp-5
            value is 64.
         01 CS-DBG-ASYNC        pic s9(9) comp-5
            value is 2.
         01 CS-DBG-DIAG pic s9(9) comp-5
            value is 128.
         01 CS-DBG-ERROR        pic s9(9) comp-5
            value is 4.
         01 CS-DBG-MEM  pic s9(9) comp-5
            value is 8.
         01 CS-DBG-NETWORK      pic s9(9) comp-5
            value is 256.
         01 CS-DBG-PROTOCOL     pic s9(9) comp-5
            value is 16.
         01 CS-DBG-PROTOCOL-STATES      pic s9(9) comp-5
            value is 32.
         01 CS-DEALLOC  pic s9(9) comp-5
            value is 711.
         01 CS-DECIMAL-TYPE     pic s9(9) comp-5
            value is 17.
         01 CS-DEF-PREC pic s9(9) comp-5
            value is 18.
         01 CS-DEF-SCALE        pic s9(9) comp-5
            value is 0.
         01 CS-DESCIN   pic s9(9) comp-5
            value is 64.
         01 CS-DESCOUT  pic s9(9) comp-5
            value is 128.
         01 CS-DESCRIBE-INPUT   pic s9(9) comp-5
            value is 720.
         01 CS-DESCRIBE-OUTPUT  pic s9(9) comp-5
            value is 721.
         01 CS-DESCRIBE-RESULT  pic s9(9) comp-5
            value is 4051.
         01 CS-DIAG-TIMEOUT     pic s9(9) comp-5
            value is 9132.
         01 CS-DISABLE-POLL     pic s9(9) comp-5
            value is 9133.
         01 CS-DIV      pic s9(9) comp-5
            value is 4.
         01 CS-DSLS-TYPE        pic s9(9) comp-5
            value is 108.
         01 CS-DSL-TYPE pic s9(9) comp-5
            value is 110.
         01 CS-DSTS-TYPE        pic s9(9) comp-5
            value is 109.
         01 CS-DST-TYPE pic s9(9) comp-5
            value is 111.
         01 CS-DU-TYPE  pic s9(9) comp-5
            value is 115.
         01 CS-DYNAMIC  pic s9(9) comp-5
            value is 4.
         01 CS-DYN-CURSOR-DECLARE       pic s9(9) comp-5
            value is 722.
         01 CS-EBADLEN  pic s9(9) comp-5
            value is -215.
         01 CS-EBADPARAM        pic s9(9) comp-5
            value is -214.
         01 CS-ECOBDTRUNC       pic s9(9) comp-5
            value is -107.
         01 CS-EDIVZERO pic s9(9) comp-5
            value is -108.
         01 CS-EDOMAIN  pic s9(9) comp-5
            value is -107.
         01 CS-EDTRUNCPREC      pic s9(9) comp-5
            value is -106.
         01 CS-EED-CMD  pic s9(9) comp-5
            value is 9131.
         01 CS-EFORMAT  pic s9(9) comp-5
            value is -106.
         01 CS-ENCRYPT-CB       pic s9(9) comp-5
            value is 5.
         01 CS-END      pic s9(9) comp-5
            value is 32.
         01 CS-END-DATA pic s9(9) comp-5
            value is -204.
         01 CS-END-ITEM pic s9(9) comp-5
            value is -206.
         01 CS-END-RESULTS      pic s9(9) comp-5
            value is -205.
         01 CS-ENOBIND  pic s9(9) comp-5
            value is -112.
         01 CS-ENOCNVRT pic s9(9) comp-5
            value is -216.
         01 CS-ENULLNOIND       pic s9(9) comp-5
            value is -110.
         01 CS-EOVERFLOW        pic s9(9) comp-5
            value is -101.
         01 CS-EPRECISION       pic s9(9) comp-5
            value is -103.
         01 CS-EPRECSCALE       pic s9(9) comp-5
            value is -108.
         01 CS-ERESOURCE        pic s9(9) comp-5
            value is -109.
         01 CS-ESCALE   pic s9(9) comp-5
            value is -104.
         01 CS-ESYNTAX  pic s9(9) comp-5
            value is -105.
         01 CS-ETRUNCNOIND      pic s9(9) comp-5
            value is -111.
         01 CS-EUNDERFLOW       pic s9(9) comp-5
            value is -102.
         01 CS-EXECUTE  pic s9(9) comp-5
            value is 718.
         01 CS-EXEC-IMMEDIATE   pic s9(9) comp-5
            value is 719.
         01 CS-EXPOSE-FMTS      pic s9(9) comp-5
            value is 9120.
         01 CS-EXPRESSION       pic s9(9) comp-5
            value is 2048.
         01 CS-EXTERNAL-CONFIG  pic s9(9) comp-5
            value is 9155.
         01 CS-EXTERNAL-ERR     pic s9(9) comp-5
            value is -200.
         01 CS-EXTRA-INF        pic s9(9) comp-5
            value is 9121.
         01 CS-FAIL     pic s9(9) comp-5
            value is 0.
         01 CS-FALSE    pic s9(9) comp-5
            value is 0.
         01 CS-FIRST    pic s9(9) comp-5
            value is 3000.
         01 CS-FLOAT-TYPE       pic s9(9) comp-5
            value is 10.
         01 CS-FMT-CHECKNINES   pic s9(9) comp-5
            value is 65536.
         01 CS-FMT-JUSTIFY-RT   pic s9(9) comp-5
            value is 8.
         01 CS-FMT-NULLTERM     pic s9(9) comp-5
            value is 1.
         01 CS-FMT-PADBLANK     pic s9(9) comp-5
            value is 4.
         01 CS-FMT-PADNULL      pic s9(9) comp-5
            value is 2.
         01 CS-FMT-UNUSED       pic s9(9) comp-5
            value is 0.
         01 CS-FORCE-CLOSE      pic s9(9) comp-5
            value is 301.
         01 CS-FORCE-EXIT       pic s9(9) comp-5
            value is 300.
         01 CS-FOR-UPDATE       pic s9(9) comp-5
            value is 1.
         01 CS-GET      pic s9(9) comp-5
            value is 33.
         01 CS-GETATTR  pic s9(9) comp-5
            value is 715.
         01 CS-GETCNT   pic s9(9) comp-5
            value is 713.
         01 CS-GET-IN   pic s9(9) comp-5
            value is 730.
         01 CS-GET-OUT  pic s9(9) comp-5
            value is 731.
         01 CS-GOODDATA pic s9(4) comp-5
            value is 0.
         01 CS-HAFAILOVER       pic s9(9) comp-5
            value is 9196.
         01 CS-HASEED   pic s9(9) comp-5
            value is 1.
         01 CS-HAVE-CMD pic s9(9) comp-5
            value is 9152.
         01 CS-HAVE-BINDS       pic s9(9) comp-5
            value is 9153.
         01 CS-HAVE-CUROPEN     pic s9(9) comp-5
            value is 9154.
         01 CS-HIDDEN   pic s9(9) comp-5
            value is 1.
         01 CS-HIDDEN-KEYS      pic s9(9) comp-5
            value is 9113.
         01 CS-HOSTNAME pic s9(9) comp-5
            value is 9103.
         01 CS-IFILE    pic s9(9) comp-5
            value is 9115.
         01 CS-ILLEGAL-TYPE     pic s9(9) comp-5
            value is -1.
         01 CS-IMAGE-TYPE       pic s9(9) comp-5
            value is 5.
         01 CS-INIT     pic s9(9) comp-5
            value is 36.
         01 CS-INPUTVALUE       pic s9(9) comp-5
            value is 256.
         01 CS-INTERNAL-ERR     pic s9(9) comp-5
            value is -300.
         01 CS-INT-TYPE pic s9(9) comp-5
            value is 8.
         01 CS-IODATA   pic s9(9) comp-5
            value is 1600.
         01 CS-ISBROWSE pic s9(9) comp-5
            value is 9000.
         01 CS-KEY      pic s9(9) comp-5
            value is 2.
         01 CS-LANG-CMD pic s9(9) comp-5
            value is 148.
         01 CS-LAST     pic s9(9) comp-5
            value is 3003.
         01 CS-LC-ALL   pic s9(9) comp-5
            value is 7.
         01 CS-LC-COLLATE       pic s9(9) comp-5
            value is 1.
         01 CS-LC-CTYPE pic s9(9) comp-5
            value is 2.
         01 CS-LC-MESSAGE       pic s9(9) comp-5
            value is 3.
         01 CS-LC-MONETARY      pic s9(9) comp-5
            value is 4.
         01 CS-LC-NUMERIC       pic s9(9) comp-5
            value is 5.
         01 CS-LC-TIME  pic s9(9) comp-5
            value is 6.
         01 CS-LOC-PROP pic s9(9) comp-5
            value is 9125.
         01 CS-LOGIN-STATUS     pic s9(9) comp-5
            value is 9104.
         01 CS-LOGIN-TIMEOUT    pic s9(9) comp-5
            value is 9116.
         01 CS-LONGBINARY-TYPE  pic s9(9) comp-5
            value is 3.
         01 CS-LONGCHAR-TYPE    pic s9(9) comp-5
            value is 2.
         01 CS-LPI-COBOL        pic s9(9) comp-5
            value is 1.
         01 CS-MAXSYB-TYPE      pic s9(9) comp-5
            value is 40.
         01 CS-MAX-CAPVALUE     pic s9(9) comp-5
            value is 103.
         01 CS-MAX-CHAR pic s9(9) comp-5
            value is 256.
         01 CS-MAX-CONNECT      pic s9(9) comp-5
            value is 9118.
         01 CS-MAX-MSG  pic s9(9) comp-5
            value is 1024.
         01 CS-MAX-OPTION       pic s9(9) comp-5
            value is 5050.
         01 CS-MAX-PREC pic s9(9) comp-5
            value is 77.
         01 CS-MAX-REQ-CAP      pic s9(9) comp-5
            value is 103.
         01 CS-MAX-RES-CAP      pic s9(9) comp-5
            value is 70.
         01 CS-MAX-SCALE        pic s9(9) comp-5
            value is 77.
         01 CS-MAX-SYBTYPE      pic s9(9) comp-5
            value is 39.
         01 CS-MEM-ERROR        pic s9(9) comp-5
            value is -1.
         01 CS-MESSAGE-CB       pic s9(9) comp-5
            value is 9119.
         01 CS-MF-BYTE-COBOL    pic s9(9) comp-5
            value is 4.
         01 CS-MF-WORD-COBOL    pic s9(9) comp-5
            value is 3.
         01 CS-MIN-CAPVALUE     pic s9(9) comp-5
            value is 1.
         01 CS-MIN-OPTION       pic s9(9) comp-5
            value is 5001.
         01 CS-MIN-PREC pic s9(9) comp-5
            value is 1.
         01 CS-MIN-REQ-CAP      pic s9(9) comp-5
            value is 1.
         01 CS-MIN-RES-CAP      pic s9(9) comp-5
            value is 1.
         01 CS-MIN-SCALE        pic s9(9) comp-5
            value is 0.
         01 CS-MIN-SYBTYPE      pic s9(9) comp-5
            value is 0.
         01 CS-MONEY4-TYPE      pic s9(9) comp-5
            value is 15.
         01 CS-MONEY-TYPE       pic s9(9) comp-5
            value is 14.
         01 CS-MONTH    pic s9(9) comp-5
            value is 7340.
         01 CS-MORE     pic s9(9) comp-5
            value is 16.
         01 CS-MSGLIMIT pic s9(9) comp-5
            value is 38.
         01 CS-MSGTYPE  pic s9(9) comp-5
            value is 806.
         01 CS-MSG-CMD  pic s9(9) comp-5
            value is 150.
         01 CS-MSG-RESULT       pic s9(9) comp-5
            value is 4044.
         01 CS-MULT     pic s9(9) comp-5
            value is 3.
         01 CS-NETIO    pic s9(9) comp-5
            value is 9110.
         01 CS-NEXT     pic s9(9) comp-5
            value is 3001.
         01 CS-NODATA   pic s9(9) comp-5
            value is 8.
         01 CS-NOINTERRUPT      pic s9(9) comp-5
            value is 9111.
         01 CS-NOMSG    pic s9(9) comp-5
            value is -207.
         01 CS-NOSCROLL-INSENSITIVE     pic s9(9) comp-5
            value is 4096.
         01 CS-NOTIF-CB pic s9(9) comp-5
            value is 4.
         01 CS-NOTIF-CMD        pic s9(9) comp-5
            value is 9134.
         01 CS-NO-LIMIT pic s9(9) comp-5
            value is -9999.
         01 CS-NO-RECOMPILE     pic s9(9) comp-5
            value is 189.
         01 CS-NULL     pic s9(9) comp-5
            value is 0.
         01 CS-NULLDATA pic s9(4) comp-5
            value is -1.
         01 CS-NULLTERM pic s9(9) comp-5
            value is -9.
         01 CS-NULL-STRING      pic s9(9) comp-5
            value is -101.
         01 CS-NUMDATA  pic s9(9) comp-5
            value is 803.
         01 CS-NUMERIC-TYPE     pic s9(9) comp-5
            value is 16.
         01 CS-NUMORDERCOLS     pic s9(9) comp-5
            value is 805.
         01 CS-NUM-COMPUTES     pic s9(9) comp-5
            value is 802.
         01 CS-OPT-ANSINULL     pic s9(9) comp-5
            value is 5034.
         01 CS-OPT-ARITHABORT   pic s9(9) comp-5
            value is 5017.
         01 CS-OPT-ARITHIGNORE  pic s9(9) comp-5
            value is 5015.
         01 CS-OPT-CHAINXACTS   pic s9(9) comp-5
            value is 5025.
         01 CS-OPT-CHARSET      pic s9(9) comp-5
            value is 5010.
         01 CS-OPT-CURCLOSEONXACT       pic s9(9) comp-5
            value is 5026.
         01 CS-OPT-DATEFIRST    pic s9(9) comp-5
            value is 5001.
         01 CS-OPT-DATEFORMAT   pic s9(9) comp-5
            value is 5007.
         01 CS-OPT-FIPSFLAG     pic s9(9) comp-5
            value is 5027.
         01 CS-OPT-FMTDMY       pic s9(9) comp-5
            value is 2.
         01 CS-OPT-FMTDYM       pic s9(9) comp-5
            value is 6.
         01 CS-OPT-FMTMDY       pic s9(9) comp-5
            value is 1.
         01 CS-OPT-FMTMYD       pic s9(9) comp-5
            value is 5.
         01 CS-OPT-FMTYDM       pic s9(9) comp-5
            value is 4.
         01 CS-OPT-FMTYMD       pic s9(9) comp-5
            value is 3.
         01 CS-OPT-FORCEPLAN    pic s9(9) comp-5
            value is 5023.
         01 CS-OPT-FORMATONLY   pic s9(9) comp-5
            value is 5024.
         01 CS-OPT-FRIDAY       pic s9(9) comp-5
            value is 5.
         01 CS-OPT-GETDATA      pic s9(9) comp-5
            value is 5020.
         01 CS-OPT-ISOLATION    pic s9(9) comp-5
            value is 5008.
         01 CS-OPT-LEVEL1       pic s9(9) comp-5
            value is 1.
         01 CS-OPT-LEVEL3       pic s9(9) comp-5
            value is 3.
         01 CS-OPT-MONDAY       pic s9(9) comp-5
            value is 1.
         01 CS-OPT-NATLANG      pic s9(9) comp-5
            value is 5006.
         01 CS-OPT-NOCOUNT      pic s9(9) comp-5
            value is 5021.
         01 CS-OPT-NOEXEC       pic s9(9) comp-5
            value is 5014.
         01 CS-OPT-PARSEONLY    pic s9(9) comp-5
            value is 5018.
         01 CS-OPT-RESTREES     pic s9(9) comp-5
            value is 5028.
         01 CS-OPT-ROWCOUNT     pic s9(9) comp-5
            value is 5005.
         01 CS-OPT-SATURDAY     pic s9(9) comp-5
            value is 6.
         01 CS-OPT-SHOWPLAN     pic s9(9) comp-5
            value is 5013.
         01 CS-OPT-STATS-IO     pic s9(9) comp-5
            value is 5004.
         01 CS-OPT-STATS-TIME   pic s9(9) comp-5
            value is 5003.
         01 CS-OPT-SUNDAY       pic s9(9) comp-5
            value is 7.
         01 CS-OPT-TEXTSIZE     pic s9(9) comp-5
            value is 5002.
         01 CS-OPT-THURSDAY     pic s9(9) comp-5
            value is 4.
         01 CS-OPT-TRUNCIGNORE  pic s9(9) comp-5
            value is 5016.
         01 CS-OPT-TUESDAY      pic s9(9) comp-5
            value is 2.
         01 CS-OPT-WEDNESDAY    pic s9(9) comp-5
            value is 3.
         01 CS-OPT-QUOTED-IDENT pic s9(9) comp-5
            value is 5035.
         01 CS-OPT-ANSIPERM     pic s9(9) comp-5
            value is 5036.
         01 CS-OPT-STR-RTRUNC   pic s9(9) comp-5
            value is 5037.
         01 CS-OPT-SORTMERGE    pic s9(9) comp-5
            value is 5038.
         01 CS-OPT-CURREAD      pic s9(9) comp-5
            value is 5030.
         01 CS-OPT-CURWRITE     pic s9(9) comp-5
            value is 5031.
         01 CS-OPT-JTC  pic s9(9) comp-5
            value is 5039.
         01 CS-OPT-CLIENTREALNAME       pic s9(9) comp-5
            value is 5040.
         01 CS-OPT-CLIENTHOSTNAME       pic s9(9) comp-5
            value is 5041.
         01 CS-OPT-CLIENTAPPLNAME       pic s9(9) comp-5
            value is 5042.
         01 CS-OPT-IDENTITYON   pic s9(9) comp-5
            value is 5029.
         01 CS-OPT-IDENTITYOFF  pic s9(9) comp-5
            value is 5032.
         01 CS-OPT-IDENTITYUPD-ON       pic s9(9) comp-5
            value is 5043.
         01 CS-OPT-IDENTITYUPD-OFF      pic s9(9) comp-5
            value is 5044.
         01 CS-OPT-NODATA       pic s9(9) comp-5
            value is 5045.
         01 CS-OPT-CIPHERTEXT   pic s9(9) comp-5
            value is 5046.
         01 CS-OPT-SHOW-FI      pic s9(9) comp-5
            value is 5047.
         01 CS-OPT-HIDE-VCC     pic s9(9) comp-5
            value is 5048.
         01 CS-OP-AVG   pic s9(9) comp-5
            value is 5371.
         01 CS-OP-COUNT pic s9(9) comp-5
            value is 5372.
         01 CS-OP-MAX   pic s9(9) comp-5
            value is 5374.
         01 CS-OP-MIN   pic s9(9) comp-5
            value is 5373.
         01 CS-OP-SUM   pic s9(9) comp-5
            value is 5370.
         01 CS-ORDERBY-COLS     pic s9(9) comp-5
            value is 804.
         01 CS-PACKAGE-CMD      pic s9(9) comp-5
            value is 152.
         01 CS-PACKEDEC-TYPE    pic s9(9) comp-5
            value is 112.
         01 CS-PACKETSIZE       pic s9(9) comp-5
            value is 9107.
         01 CS-PARAM-NOTNULL    pic s9(9) comp-5
            value is -103.
         01 CS-PARAM-NULL       pic s9(9) comp-5
            value is -102.
         01 CS-PARAM-RESULT     pic s9(9) comp-5
            value is 4042.
         01 CS-PARENT-HANDLE    pic s9(9) comp-5
            value is 9130.
         01 CS-PARSE-TREE       pic s9(9) comp-5
            value is 8710.
         01 CS-PASSTHRU-EOM     pic s9(9) comp-5
            value is -210.
         01 CS-PASSTHRU-MORE    pic s9(9) comp-5
            value is -211.
         01 CS-PASSWORD pic s9(9) comp-5
            value is 9101.
         01 CS-PREPARE  pic s9(9) comp-5
            value is 717.
         01 CS-PREV     pic s9(9) comp-5
            value is 3002.
         01 CS-PROCNAME pic s9(9) comp-5
            value is 723.
         01 CS-PROTO-BULK       pic s9(9) comp-5
            value is 43.
         01 CS-PROTO-NOBULK     pic s9(9) comp-5
            value is 30.
         01 CS-PROTO-NOTEXT     pic s9(9) comp-5
            value is 29.
         01 CS-PROTO-TEXT       pic s9(9) comp-5
            value is 42.
         01 CS-READ-ONLY        pic s9(9) comp-5
            value is 2.
         01 CS-REAL-TYPE        pic s9(9) comp-5
            value is 9.
         01 CS-RECOMPILE        pic s9(9) comp-5
            value is 188.
         01 CS-RELATIVE pic s9(9) comp-5
            value is 3005.
         01 CS-RENAMED  pic s9(9) comp-5
            value is 4096.
         01 CS-REQ-BCP  pic s9(9) comp-5
            value is 5.
         01 CS-REQ-CURSOR       pic s9(9) comp-5
            value is 6.
         01 CS-REQ-LANG pic s9(9) comp-5
            value is 1.
         01 CS-REQ-MSG  pic s9(9) comp-5
            value is 8.
         01 CS-REQ-MSTMT        pic s9(9) comp-5
            value is 4.
         01 CS-REQ-RPC  pic s9(9) comp-5
            value is 2.
         01 CS-RES-NOEED        pic s9(9) comp-5
            value is 2.
         01 CS-RES-NOMSG        pic s9(9) comp-5
            value is 1.
         01 CS-RES-NOPARAM      pic s9(9) comp-5
            value is 3.
         01 CS-RES-NOSTRIPBLANKS        pic s9(9) comp-5
            value is 34.
         01 CS-RESTORE-OPEN     pic s9(9) comp-5
            value is 8.
         01 CS-SCROLL-CURSOR    pic s9(9) comp-5
            value is 2048.
         01 CS-SCROLL-CURSOR-ENDS       pic s9(9) comp-5
            value is -217.
         01 CS-SCROLL-INSENSITIVE       pic s9(9) comp-5
            value is 256.
         01 CS-SCROLL-SEMISENSITIVE     pic s9(9) comp-5
            value is 512.
         01 CS-CUR-RELLOCKS-ONCLOSE     pic s9(9) comp-5
            value is 8192.
         01 CS-SEC-NEGOTIATE    pic s9(9) comp-5
            value is 9137.
         01 CS-SQLDA-SYBASE     pic s9(9) comp-5
            value is 729.
         01 CS-SQLDA-BIND       pic s9(9) comp-5
            value is 732.
         01 CS-SQLDA-PARAM      pic s9(9) comp-5
            value is 733.
         01 CS-RETURN   pic s9(9) comp-5
            value is 1024.
         01 CS-ROWFMT-RESULT    pic s9(9) comp-5
            value is 4049.
         01 CS-ROW-COUNT        pic s9(9) comp-5
            value is 800.
         01 CS-ROW-FAIL pic s9(9) comp-5
            value is -203.
         01 CS-ROW-RESULT       pic s9(9) comp-5
            value is 4040.
         01 CS-RPC-CMD  pic s9(9) comp-5
            value is 149.
         01 CS-SEND-BULK-CMD    pic s9(9) comp-5
            value is 153.
         01 CS-SEND-DATA-CMD    pic s9(9) comp-5
            value is 151.
         01 CS-SERVERMSG-CB     pic s9(9) comp-5
            value is 2.
         01 CS-SERVERMSG-TYPE   pic s9(9) comp-5
            value is 4701.
         01 CS-SET      pic s9(9) comp-5
            value is 34.
         01 CS-SETATTR  pic s9(9) comp-5
            value is 716.
         01 CS-SETCNT   pic s9(9) comp-5
            value is 714.
         01 CS-SET-DBG-FILE     pic s9(9) comp-5
            value is 1702.
         01 CS-SET-FLAG pic s9(9) comp-5
            value is 1700.
         01 CS-SET-PROTOCOL-FILE        pic s9(9) comp-5
            value is 1703.
         01 CS-SHORTMONTH       pic s9(9) comp-5
            value is 7341.
         01 CS-SIGNAL-CB        pic s9(9) comp-5
            value is 100.
         01 CS-SMALLINT-TYPE    pic s9(9) comp-5
            value is 7.
         01 CS-SORT     pic s9(9) comp-5
            value is 7441.
         01 CS-SRC-VALUE        pic s9(9) comp-5
            value is -2562.
         01 CS-STATUS   pic s9(9) comp-5
            value is 37.
         01 CS-STATUS-RESULT    pic s9(9) comp-5
            value is 4043.
         01 CS-STICKY-BINDS     pic s9(9) comp-5
            value is 9151.
         01 CS-SUB      pic s9(9) comp-5
            value is 2.
         01 CS-SUCCEED  pic s9(9) comp-5
            value is 1.
         01 CS-SV-API-FAIL      pic s9(9) comp-5
            value is 1.
         01 CS-SV-COMM-FAIL     pic s9(9) comp-5
            value is 5.
         01 CS-SV-CONFIG-FAIL   pic s9(9) comp-5
            value is 4.
         01 CS-SV-FATAL pic s9(9) comp-5
            value is 7.
         01 CS-SV-INFORM        pic s9(9) comp-5
            value is 0.
         01 CS-SV-INTERNAL-FAIL pic s9(9) comp-5
            value is 6.
         01 CS-SV-RESOURCE-FAIL pic s9(9) comp-5
            value is 3.
         01 CS-SV-RETRY-FAIL    pic s9(9) comp-5
            value is 2.
         01 CS-SWAPBIGINT-TYPE  pic s9(9) comp-5
            value is 124.
         01 CS-SWAPCOMPNUM-TYPE pic s9(9) comp-5
            value is 122.
         01 CS-SWAPINT-TYPE     pic s9(9) comp-5
            value is 107.
         01 CS-SWAPMEDINT-TYPE  pic s9(9) comp-5
            value is 106.
         01 CS-SWAPSMALLINT-TYPE        pic s9(9) comp-5
            value is 105.
         01 CS-SWAPUCOMPNUM-TYPE        pic s9(9) comp-5
            value is 121.
         01 CS-SYNC-IO  pic s9(9) comp-5
            value is 8111.
         01 CS-TABNAME  pic s9(9) comp-5
            value is 9002.
         01 CS-TABNUM   pic s9(9) comp-5
            value is 9001.
         01 CS-TDS-40   pic s9(9) comp-5
            value is 7360.
         01 CS-TDS-42   pic s9(9) comp-5
            value is 7361.
         01 CS-TDS-46   pic s9(9) comp-5
            value is 7362.
         01 CS-TDS-495  pic s9(9) comp-5
            value is 7363.
         01 CS-TDS-50   pic s9(9) comp-5
            value is 7364.
         01 CS-TDS-VERSION      pic s9(9) comp-5
            value is 9105.
         01 CS-TEXTLIMIT        pic s9(9) comp-5
            value is 9112.
         01 CS-TEXT-TYPE        pic s9(9) comp-5
            value is 4.
         01 CS-TIME-TYPE        pic s9(9) comp-5
            value is 28.
         01 CS-TIMED-OUT        pic s9(9) comp-5
            value is -208.
         01 CS-TIMEOUT  pic s9(9) comp-5
            value is 9117.
         01 CS-TIMESTAMP        pic s9(9) comp-5
            value is 8192.
         01 CS-TINYINT-TYPE     pic s9(9) comp-5
            value is 6.
         01 CS-TP-SIZE  pic s9(9) comp-5
            value is 16.
         01 CS-TRANSACTION-NAME pic s9(9) comp-5
            value is 9122.
         01 CS-TRANS-STATE      pic s9(9) comp-5
            value is 808.
         01 CS-TRAN-COMPLETED   pic s9(9) comp-5
            value is 2.
         01 CS-TRAN-FAIL        pic s9(9) comp-5
            value is 3.
         01 CS-TRAN-IN-PROGRESS pic s9(9) comp-5
            value is 1.
         01 CS-TRAN-STMT-FAIL   pic s9(9) comp-5
            value is 4.
         01 CS-TRAN-UNDEFINED   pic s9(9) comp-5
            value is 0.
         01 CS-TRUE     pic s9(9) comp-5
            value is 1.
         01 CS-TRUNCATED        pic s9(9) comp-5
            value is -113.
         01 CS-TS-SIZE  pic s9(9) comp-5
            value is 8.
         01 CS-UBIGINT-TYPE     pic s9(9) comp-5
            value is 33.
         01 CS-UCOBBIGINT-TYPE  pic s9(9) comp-5
            value is 129.
         01 CS-UCOBINT-TYPE     pic s9(9) comp-5
            value is 127.
         01 CS-UCOBSMALLINT-TYPE        pic s9(9) comp-5
            value is 125.
         01 CS-UCOMPNUM-TYPE    pic s9(9) comp-5
            value is 120.
         01 CS-UINT-TYPE        pic s9(9) comp-5
            value is 32.
         01 CS-UNUSED   pic s9(9) comp-5
            value is -99999.
         01 CS-UPACKEDEC-TYPE   pic s9(9) comp-5
            value is 114.
         01 CS-UPDATABLE        pic s9(9) comp-5
            value is 16.
         01 CS-UPDATECOL        pic s9(9) comp-5
            value is 512.
         01 CS-USERDATA pic s9(9) comp-5
            value is 9108.
         01 CS-USERNAME pic s9(9) comp-5
            value is 9100.
         01 CS-USER-TYPE        pic s9(9) comp-5
            value is 100.
         01 CS-USE-DESC pic s9(9) comp-5
            value is 712.
         01 CS-USE-DISCOVERED-APPNAME   pic s9(9) comp-5
            value is 9222.
         01 CS-SANITIZE-DISC-APPNAME    pic s9(9) comp-5
            value is 9223.
         01 CS-USMALLINT-TYPE   pic s9(9) comp-5
            value is 31.
         01 CS-USWAPBIGINT-TYPE pic s9(9) comp-5
            value is 130.
         01 CS-USWAPINT-TYPE    pic s9(9) comp-5
            value is 128.
         01 CS-USWAPSMALLINT-TYPE       pic s9(9) comp-5
            value is 126.
         01 CS-VARBINARY-TYPE   pic s9(9) comp-5
            value is 19.
         01 CS-VARCHAR-TYPE     pic s9(9) comp-5
            value is 18.
         01 CS-VERSION  pic s9(9) comp-5
            value is 9114.
         01 CS-VERSION-100      pic s9(9) comp-5
            value is 113.
         01 CS-VERSION-110      pic s9(9) comp-5
            value is 1101.
         01 CS-VERSION-120      pic s9(9) comp-5
            value is 1101.
         01 CS-VERSION-125      pic s9(9) comp-5
            value is 12501.
         01 CS-VERSION-150      pic s9(9) comp-5
            value is 15001.
         01 CS-VERSION-155      pic s9(9) comp-5
            value is 15501.
         01 CS-VERSION-157      pic s9(9) comp-5
            value is 15701.
         01 CS-CURRENT-VERSION  pic s9(9) comp-5
            value is 15701.
         01 CS-VERSION-KEY      pic s9(9) comp-5
            value is 4.
         01 CS-VMS-COBOL        pic s9(9) comp-5
            value is 2.
         01 CS-WILDCARD pic s9(9) comp-5
            value is -99.
         01 CS-XML-TYPE pic s9(9) comp-5
            value is 34.
         01 CS-ZERO     pic s9(9) comp-5
            value is 5.
         01 CT-BIND     pic s9(9) comp-5
            value is 0.
         01 CT-BR-COLUMN        pic s9(9) comp-5
            value is 1.
         01 CT-BR-TABLE pic s9(9) comp-5
            value is 2.
         01 CT-CALLBACK pic s9(9) comp-5
            value is 3.
         01 CT-CANCEL   pic s9(9) comp-5
            value is 4.
         01 CT-CAPABILITY       pic s9(9) comp-5
            value is 5.
         01 CT-CLOSE    pic s9(9) comp-5
            value is 6.
         01 CT-CMD-ALLOC        pic s9(9) comp-5
            value is 7.
         01 CT-CMD-DROP pic s9(9) comp-5
            value is 8.
         01 CT-CMD-PROPS        pic s9(9) comp-5
            value is 9.
         01 CT-COMMAND  pic s9(9) comp-5
            value is 10.
         01 CT-COMPUTE-INFO     pic s9(9) comp-5
            value is 11.
         01 CT-CONFIG   pic s9(9) comp-5
            value is 16.
         01 CT-CONNECT  pic s9(9) comp-5
            value is 17.
         01 CT-CON-ALLOC        pic s9(9) comp-5
            value is 12.
         01 CT-CON-DROP pic s9(9) comp-5
            value is 13.
         01 CT-CON-PROPS        pic s9(9) comp-5
            value is 14.
         01 CT-CON-XFER pic s9(9) comp-5
            value is 15.
         01 CT-CURSOR   pic s9(9) comp-5
            value is 18.
         01 CT-DATA-INFO        pic s9(9) comp-5
            value is 19.
         01 CT-DEBUG    pic s9(9) comp-5
            value is 20.
         01 CT-DESCRIBE pic s9(9) comp-5
            value is 21.
         01 CT-DIAG     pic s9(9) comp-5
            value is 22.
         01 CT-DYNAMIC  pic s9(9) comp-5
            value is 23.
         01 CT-DYNDESC  pic s9(9) comp-5
            value is 24.
         01 CT-EXIT     pic s9(9) comp-5
            value is 25.
         01 CT-FETCH    pic s9(9) comp-5
            value is 26.
         01 CT-GETFORMAT        pic s9(9) comp-5
            value is 28.
         01 CT-GETLOGINFO       pic s9(9) comp-5
            value is 29.
         01 CT-GET-DATA pic s9(9) comp-5
            value is 27.
         01 CT-INIT     pic s9(9) comp-5
            value is 30.
         01 CT-KEYDATA  pic s9(9) comp-5
            value is 31.
         01 CT-OPTIONS  pic s9(9) comp-5
            value is 32.
         01 CT-PARAM    pic s9(9) comp-5
            value is 33.
         01 CT-POLL     pic s9(9) comp-5
            value is 34.
         01 CT-RECVPASSTHRU     pic s9(9) comp-5
            value is 35.
         01 CT-REMOTE-PWD       pic s9(9) comp-5
            value is 36.
         01 CT-RESULTS  pic s9(9) comp-5
            value is 38.
         01 CT-RES-INFO pic s9(9) comp-5
            value is 37.
         01 CT-SEND     pic s9(9) comp-5
            value is 39.
         01 CT-SENDPASSTHRU     pic s9(9) comp-5
            value is 41.
         01 CT-SEND-DATA        pic s9(9) comp-5
            value is 40.
         01 CT-SETLOGINFO       pic s9(9) comp-5
            value is 42.
         01 CT-WAKEUP   pic s9(9) comp-5
            value is 43.
         01 MAX-COB-TYPE        pic s9(9) comp-5
            value is 130.
         01 MIN-COB-TYPE        pic s9(9) comp-5
            value is 100.
         01 SQLCA-TYPE  pic s9(9) comp-5
            value is 4703.
         01 SQLCODE-TYPE        pic s9(9) comp-5
            value is 4704.
         01 SQLSTATE-TYPE       pic s9(9) comp-5
            value is 4705.
         01 SYB-NO-USAGE        pic s9(9) comp-5
            value is 0.
         01 SYB-BINARY-USAGE    pic s9(9) comp-5
            value is 1.
         01 SYB-COMP-USAGE      pic s9(9) comp-5
            value is 2.
         01 SYB-COMP1-USAGE     pic s9(9) comp-5
            value is 3.
         01 SYB-COMP2-USAGE     pic s9(9) comp-5
            value is 4.
         01 SYB-COMP3-USAGE     pic s9(9) comp-5
            value is 5.
         01 SYB-COMP4-USAGE     pic s9(9) comp-5
            value is 6.
         01 SYB-COMP5-USAGE     pic s9(9) comp-5
            value is 7.
         01 SYB-COMP6-USAGE     pic s9(9) comp-5
            value is 8.
         01 SYB-COMPX-USAGE     pic s9(9) comp-5
            value is 9.
         01 SYB-DISPLAY-USAGE   pic s9(9) comp-5
            value is 10.
         01 SYB-POINTER-USAGE   pic s9(9) comp-5
            value is 11.
         01 SYB-INDEX-USAGE     pic s9(9) comp-5
            value is 12.
         01 SYB-MONEY-USAGE     pic s9(9) comp-5
            value is 13.
         01 SYB-MONEY4-USAGE    pic s9(9) comp-5
            value is 14.
         01 SYB-DATETIME-USAGE  pic s9(9) comp-5
            value is 15.
         01 SYB-DATETIME4-USAGE pic s9(9) comp-5
            value is 16.
         01 SYB-DATE-USAGE      pic s9(9) comp-5
            value is 19.
         01 SYB-TIME-USAGE      pic s9(9) comp-5
            value is 20.
         01 SYB-NO-PIC  pic s9(9) comp-5
            value is 0.
         01 SYB-SNINES-PIC      pic s9(9) comp-5
            value is 1.
         01 SYB-NINES-PIC       pic s9(9) comp-5
            value is 2.
         01 SYB-SVNINES-PIC     pic s9(9) comp-5
            value is 3.
         01 SYB-VNINES-PIC      pic s9(9) comp-5
            value is 4.
         01 SYB-X-PIC   pic s9(9) comp-5
            value is 5.
         01 SYB-NO-SIGN pic s9(9) comp-5
            value is 0.
         01 SYB-LEADING-SEPARATE-SIGN   pic s9(9) comp-5
            value is 1.
         01 SYB-TRAILING-SEPARATE-SIGN  pic s9(9) comp-5
            value is 2.
         01 SYB-LEADING-SIGN    pic s9(9) comp-5
            value is 3.
         01 SYB-TRAILING-SIGN   pic s9(9) comp-5
            value is 4.
